Tekla Open API Reference for Tekla Structures 2025
BaseComponent.PLUGIN_OBJECT_NUMBER Field
 The component number to be used when calling a plug-in or a type derived from the connection base.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int PLUGIN_OBJECT_NUMBER = -100000
Public Const PLUGIN_OBJECT_NUMBER As Integer = -100000
Field Value
Type: Int32
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace